package com.bobo.study.demo.regEx;

public class RegEx01 {
  public static void main(String[] args) {
    String content = "流行原因流行语能病毒式传播离不开体裁简洁和短视频的发展。在快节奏生活下，简洁的形式更容易被受众理解并利用。“奥利给”一词只有简单的三个字，一旦理解了其中的“梗”，便很易于传播。此外，快文化背景下的主要产物之一就是短视频，网络短视频形成了小型的互动社区，大量原创用户积极投入拍摄，创造了一个内容丰富有趣的媒介生态环境。在B站，名为“正能量语录奥利给”的18秒视频，播放量就达到了2683万，弹幕数量也达到了10.1万。“奥利给”在短视频中的传播，因有大量互动弹幕而提高了其关键词的到达率，弹幕上的“奥利给”也容易吸引观看者的注意，使观看者更有兴趣探索其含义和效仿利用这一流行语。网友有求新从众心理。“奥利给”的原身“给力”走红于2010年，在年轻人心中已经过时，网友需要更适合当下的词汇，“奥利给”便是一个很好的替代品。它更年轻有趣，满足网友追求新鲜事物的心理。同时，当网络流行语流行到一定程度时，从众心理会使人们为了追赶潮流而学习使用。“奥利给”正能量的表达方式。“奥利给”是具备正能量的流行语，各新闻媒体包容它的存在，并利用它拉近与网络人群的距离感。自媒体个人频繁使用它，不仅增强个人的人格魅力，也吸引观众关注。“冬泳怪鸽”喊出“加油，奥利给！”的时候，也是在向受众传播正能量。积极正面的流行语引导正面情绪,引领受众传播正面情感,产生积极的社会影响，可获得更多认可。 [2] 发展过程2019年，冬泳怪鸽的“加油，奥利给”以及岛市老八的“奥利给，干了兄弟们”进行创作的关于奥利给的二次创作开始流行。而后“岛市老八”在快手平台复出，继续吃播视频创作，并成为B站鬼畜中的素材，干呕声被制成音MAD。同时，岛市老八的行为赋予了“奥利给”一词新的意思，即固态排泄物。 [2]  [4] 2019年10月，“奥利给”已被广泛传播。在2020年1月1日0时50分左右央视新闻频道的《年轮2019》中，有“加油，奥利给”的语音片段。 [2] ";
    

    
  }
}
